/**
 * Домашнее задание по теме "String"
 *
 * 1.     Дан массив со строками: String[] stringArray = {"ab", "cd", "ef"}. Получите массив символов этих строк: char[] charArray =  {'a', 'b', 'c', 'd', 'e', 'f'}.
 *
 * 2.     Дана строка: String stroke = "12345". Выведите в консоль значение, которое можно, взяв первый и последний символ этой строки в следующем виде. Т.е.  "15".
 *
 * 3.     Дана некоторая строка - "1203405". Найдите позицию первого нуля в строке. Т.е. позиция первого нуля в этой строке равна 2.
 */

public class Main {
    public static void main(String[] args) {
        String[] stringArray = {"ab", "cd", "ef"};
        String stroke = "12345";
        String str = "1203405";

    }
}