/**
 * 1.    Дан массив целых чисел. Найти максимальное число из четных в этом массиве.
 * 2.    Дана строка "Привет, Александр, с праздником, с Новым Годом". Написать программу,
 * которая поменяет регистр символов. Т.е. результат должен быть таким:
 *   пРИВЕТ, аЛЕКСАНДР, С ПРАЗДНИКОМ, С нОВЫМ гОДОМ
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}