/**
 * 1.    Напишите программу для вычисления суммы всех четных и нечетных чисел в списке с использованием потоков.
 *
 * 2. Напишите программу для удаления всех повторяющихся элементов из списка с помощью потоков
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}