/**
 * 1.   Создайте ArrayList, содержащий разные цвета, тип элемента этого динамического массива – String.
 * Напишите метод для поиска элемента в списке , содержащем эти цвета. На вход метод принимает параметр поиска.
 * Например, если список содержит «red», «blue», «green» и в аргументы метода передать «red», то метод должен вернуть true,
 * символизируя то, что этот цвет содержится в списке.
 *
 * 2.   Создайте LinkedList, содержащий целые числа, т.е. Integer. Напишите метод, который меняет местами первый и последний
 * элементы этого списка и возвращает этот список в новом виде. Т.е., если создали список [1, 2, 3, 4, 5],
 * то в результате должны получить [5, 2, 3, 4, 1].
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}