/**
 * 1.    Необходимо написать метод, который возвращает позицию буквы алфавита. Для реализации программы создать enum алфавита.
 *
 * 2.    Написать класс Person с полями имени(name), возраста(age). Для определения пола Person создать enum Gender
 * с соответствующими константами. В классе с методом main создать список объектов Person, состоящий не менее,
 * чем из 10 человек разного пола. Написать метод, возвращающий список объектов класса Person в зависимости
 * от введенного параметра пола, т.е. список мужчин или женщин.
 */

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}