/**
 * 1.    Написать функциональный интерфейс Printable с методом print().
 * В классе с методом main создать несколько анонимных классов с различными реализациями метода print().
 *
 * 2.    Написать функциональный интерфейс Concationble с методом concat(), который объединяет две строковых переменных,
 * передаваемых в параметры метода и возвращает строку. В классе с методом main создать несколько анонимных классов
 * с различными реализациями метода concat().
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}